In [1]:
import pandas as pd

# One Hot Encoding

In [2]:
Umur = [15,20,25,30,35,40]
Asal = ['Bali','Jawa','Bali','Jawa','Jawa','Bali']
data = {'Umur':Umur,'Asal':Asal}

In [3]:
data_umur = pd.DataFrame(data)
data_umur

   Umur  Asal
0    15  Bali
1    20  Jawa
2    25  Bali
3    30  Jawa
4    35  Jawa
5    40  Bali

In [5]:
data_one_hot = pd.get_dummies(data_umur)
data_one_hot.head(6)

   Umur  Asal_Bali  Asal_Jawa
0    15          1          0
1    20          0          1
2    25          1          0
3    30          0          1
4    35          0          1
5    40          1          0

# Data Normalisasi

In [12]:
Umur = [15,20,25,30,35,40]
Gaji = [10000000,40000000,50000000,70000000,80000000,100000000]
data = {'Umur':Umur,'Gaji':Gaji}

In [13]:
data_gaji = pd.DataFrame(data)
data_gaji

   Umur       Gaji
0    15   10000000
1    20   40000000
2    25   50000000
3    30   70000000
4    35   80000000
5    40  100000000

In [15]:
data_gaji.dtypes

Umur    int64
Gaji    int64
dtype: object

In [16]:
data_gaji.describe()

            Umur          Gaji
count   6.000000  6.000000e+00
mean   27.500000  5.833333e+07
std     9.354143  3.188521e+07
min    15.000000  1.000000e+07
25%    21.250000  4.250000e+07
50%    27.500000  6.000000e+07
75%    33.750000  7.750000e+07
max    40.000000  1.000000e+08

In [10]:
from sklearn import preprocessing

scaler = preprocessing.MinMaxScaler()
d = scaler.fit_transform(data_gaji)
data_normalisasi = pd.DataFrame(d, columns=data_gaji.columns)
data_normalisasi.head(6)

   Umur      Gaji
0   0.0  0.000000
1   0.2  0.333333
2   0.4  0.444444
3   0.6  0.666667
4   0.8  0.777778
5   1.0  1.000000

In [3]:
# datalist
Nama = ['Putu','Made','Komang','Ketut','Wayan','Kadek','Nyoman','Gede','Nengah','Luh']
Umur = [15,20,25,30,35,40,45,50,55,60]
data = {'Nama':Nama,'Umur':Umur}

In [5]:
# Create dataframe
df=pd.DataFrame(data)
df

     Nama  Umur
0    Putu    15
1    Made    20
2  Komang    25
3   Ketut    30
4   Wayan    35
5   Kadek    40
6  Nyoman    45
7    Gede    50
8  Nengah    55
9     Luh    60

# Split dataset

In [6]:
from sklearn.model_selection import train_test_split

In [13]:
X = df['Nama']
y = df['Umur']
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3)

In [14]:
X_train

8    Nengah
4     Wayan
5     Kadek
0      Putu
7      Gede
1      Made
2    Komang
Name: Nama, dtype: object

In [15]:
X_test

9       Luh
6    Nyoman
3     Ketut
Name: Nama, dtype: object

In [16]:
y_train

8    55
4    35
5    40
0    15
7    50
1    20
2    25
Name: Umur, dtype: int64

In [17]:
y_test

9    60
6    45
3    30
Name: Umur, dtype: int64

# KFold

In [53]:
from sklearn.model_selection import KFold
kf = KFold(n_splits=5)
kf

KFold(n_splits=5, random_state=None, shuffle=False)

In [54]:
for train_index, test_index in kf.split(df):
    print(train_index,test_index)

[2 3 4 5 6 7 8 9] [0 1]
[0 1 4 5 6 7 8 9] [2 3]
[0 1 2 3 6 7 8 9] [4 5]
[0 1 2 3 4 5 8 9] [6 7]
[0 1 2 3 4 5 6 7] [8 9]